Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: འཕགས་པ་བསྐལ་པ་བཟང་པོ་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Great Vehicle Sūtra The Good Eon

source: བམ་པོ་དང་པོ།
en: Chapter 1

source: སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all buddhas and bodhisattvas.

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་མཉན་ཡོད་ན་བཞུགས་ཏེ།
en: The Blessed One was residing at Śrāvasti,

source: དབྱར་གནས་པར་བཞུགས་བཞུགས་ནས།
en: where he had observed the summer retreat.

source: དབྱར་ཟླ་གསུམ་འདས་པ་དང་། ཆོས་གོས་མཛད་དོ། །
en: After the three months of summer had passed, he prepared his Dharma robes.

source: ཆོས་གོས་མཛད་ནས།
en: Once he had prepared his Dharma robes,

source: ཆོས་གོས་མནབས་ཏེ།
en: he put on the robes,

source: ལྷུང་བཟེད་ཐོགས་ནས།
en: took up his alms bowl, and,

source: ཡངས་པ་ཅན་གྱི་གྲོང་ཁྱེར་ག་ལ་བ་དེར། དགེ་སློང་འབུམ་དང་ཡང་ཐབས་ཅིག །བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་བརྒྱད་ཅུ་སྙེད་དང་ཡང་ཐབས་ཅིག་ཏུ་གཤེགས་ཏེ།
en: together with one hundred thousand monks and eight hundred million bodhisattvas, proceeded toward the city of Vaiśālī.

source: བྱོན་ནས་ཚལ་ཆེན་པོར་གཤེགས་པ་དང་། ནང་དུ་ཡང་དག་འཇོག་ལས་བཞེངས་སོ། །
en: On the way, the Blessed One entered a large forest, where he later arose from meditative seclusion.

source: བྱང་ཆུབ་སེམས་དཔའ་མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་དེ་ཡང་ནང་དུ་ཡང་དག་འཇོག་ལ་ཞུགས་པ་ལས།
en: The bodhisattva Prāmodyarāja, who had also entered meditative seclusion,

source: ནང་དུ་ཡང་དག་འཇོག་ལས་ལངས་ཏེ།
en: now likewise reemerged from this state.

source: དགེ་སློང་གི་འཁོར་དང་། དགེ་སློང་མའི་འཁོར་དང་། དགེ་བསྙེན་གྱི་འཁོར་དང་། དགེ་བསྙེན་མའི་འཁོར་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་འཁོར་དག་དང་ལྷན་ཅིག་ཏུ་སྟན་བཏིང་བ་ལ་འདུག་གོ། །
en: He and the whole assembly of monks, nuns, male lay practitioners, female lay practitioners, gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahorāgas were now seated on their mats.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཀྱང་སྣང་བ་ཐོབ་པ། གཟུངས་ཐོབ་པ། ཏིང་ངེ་འཛིན་ཐོབ་པ།
en: All of the assembled bodhisattvas had attained illumination, retention, and absorption.

source: མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ།
en: They were endowed with the five superknowledges,

source: ཚིག་གཟུང་བར་འོས་པ།
en: their words were worthy of retention,

source: ཚུལ་འཆོས་པ་མེད་པ།
en: and they were free from pretense,

source: ཤེས་ཀྱི་ཁེ་དང་།
en: had no worldly ambitions,

source: ཆགས་སེམས་དང་བྲལ་བ།
en: and were free from attachment.

source: ཟང་ཟིང་མེད་པར་ཆོས་སྟོན་པ།
en: They taught the Dharma without any regard for material things.

source: ཆོས་ཟབ་མོ་ལ་བཟོད་པའི་ཕ་རོལ་ཏུ་སོན་པ།
en: They had perfected acceptance of the profound Dharma,

source: མི་འཇིགས་པ་ཐོབ་པ།
en: had accomplished fearlessness,

source: བདུད་ཀྱི་ལས་ལས་ཡང་དག་པར་འདས་པ།
en: and were beyond the actions of the māras.

source: ལས་ཀྱི་སྒྲིབ་པ་སྤངས་པ།
en: They had shed karmic obscurations,

source: ཆོས་ཀྱི་རང་བཞིན་ལ་ཐེ་ཚོམ་མེད་པ་ཐོབ་པ།
en: achieved the state free from any doubt about the nature of the Dharma,

source: བསྐལ་པ་གྲངས་མེད་པར་སྨོན་ལམ་ཤིན་ཏུ་བསགས་པ།
en: and accumulated aspirations throughout countless eons.

source: བཞིན་འཛུམ་པ།
en: They had smiles on their faces,

source: གསོང་པོར་སྨྲ་བ།
en: spoke straightforwardly,

source: ཁྲོ་གཉེར་མེད་པ།
en: and never frowned.

source: ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་སྨྲ་བ།
en: They communicated in melodious voices,

source: སེམས་ཟིལ་གྱིས་མི་ནོན་པ།
en: their minds were indomitable,

source: སྤོབས་པ་རྒྱུན་མི་འཆད་པ།
en: and the flow of their eloquence was unbroken.

source: མཉམ་པ་ཉིད་ལ་བཟོད་པ་ཐོབ་པ།
en: They had achieved acceptance of equality.

source: འཁོར་མཐའ་ཡས་པ་ཟིལ་གྱིས་གནོན་ཅིང་མི་འཇིགས་པ་ཐོབ་པ།
en: They were able to outshine infinite gatherings without any fear.

source: ཚིག་གཅིག་གིས་བསྐལ་པ་བྱེ་བ་ཆར་ཕྱིན་པ་སྟོན་པ་ལ་མཁས་པ།
en: They were adept at elaborating on a single word throughout ten million eons.

source: ཆོས་ཐམས་ཅད་ལ་སྒྱུ་མ་དང་། སྨིག་རྒྱུ་དང་། ཆུ་ཟླ་དང་། རྨི་ལམ་དང་། བྲག་ཅ་དང་མཚུངས་པར་མོས་པ།
en: They were confident that all phenomena are just like illusions, a mirage, the moon in water, dreams, and echoes.

source: ཤེས་པ་མི་འཇིགས་པ་ཚད་མེད་པ།
en: Their minds were endowed with infinite fearlessness,

source: སེམས་ཅན་གྱི་སེམས་ཀྱི་རྒྱུ་བ་ཕྲ་མོའི་ཚུལ་དང་།
en: and they were confident in knowing the most subtle movements in the minds of sentient beings,

source: སྤྱོད་པ་སྣ་ཚོགས་ཤེས་པ་ལ་མོས་པ།
en: as well as every aspect of their conduct.

source: དགེ་བ་རྒྱ་ཆེ་བ།
en: They possessed vast virtue

source: སེམས་ཐོགས་པ་མེད་པ།
en: and their minds were unimpeded.

source: ལྷག་པའི་ང་རྒྱལ་མེད་ཅིང་བཟོད་པ་དང་ལྡན་པ།
en: They were free from exaggerating pride and endowed with patience.

source: དགེ་བ་ཇི་ལྟ་བ་བཞིན་དུ་རླབས་ཆེ་བ།
en: Their virtues were genuinely comprehensive.

source: སངས་རྒྱས་ཀྱི་ཞིང་གི་བཀོད་པ་མཐའ་ཡས་པར་སྨོན་ལམ་རབ་ཏུ་བཟུང་བ།
en: Their aspirations encompassed infinite arrays of buddha realms.

source: འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་པའི་སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་ཏིང་ངེ་འཛིན་རྟག་པར་རྒྱུན་དུ་མངོན་དུ་གྱུར་པ།
en: They constantly manifested the absorption of recollecting the buddhas of countless world systems.

source: སངས་རྒྱས་དཔག་ཏུ་མེད་པ་ལ་གསོལ་བ་འདེབས་པ་ལ་མཁས་པ།
en: They were skilled in supplicating boundless buddhas.

source: ལྟ་བ་ཐ་དད་པ་དང་། བག་ལ་ཉལ་དང་། ཀུན་ནས་དཀྲིས་པའི་ཉོན་མོངས་པ་རབ་ཏུ་ཞི་བར་བྱེད་པ་ལ་མཁས་པ།
en: They were skilled in quelling differing views, as well as latent tendencies and the fetters of emotional defilements.

source: ཏིང་ངེ་འཛིན་གྱིས་རྣམ་པར་རོལ་པ་བརྒྱ་སྟོང་བསྒྲུབ་པ་ལ་མཁས་པ་ཤ་སྟག་ལ་འདི་ལྟ་སྟེ།
en: They were skilled in accomplishing hundreds of thousands of displays through absorption.

source: བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་ལ་སོགས་པ་དང་། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་། སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་། འབྲུག་སྒྲ་དང་། དགེ་བ་བརྒྱ་སྟོང་གི་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པའི་བློ་དང་། བསྒྲུབ་པ་མཐའ་ཡས་པའི་བློ་ཅན་གློག་གིས་རབ་ཏུ་བརྒྱན་པའི་སྒྲ་དབྱངས་དང་། ཆགས་པ་མེད་པའི་མཐའ་དང་ལྡན་པའི་བློ་ཅན་དང་། རྣམ་པར་བསྒྲགས་པའི་རྒྱལ་པོ་དང་། འཐུན་པ་དང་མི་འཐུན་པ་མཐོང་བར་གྱུར་པ་དང་། གསེར་སྟུག་པོ་བསགས་པའི་འོད་གཟི་བརྗིད་ཀྱི་རྒྱལ་པོ་དང་། དཔག་ཚད་བརྒྱར་རྣམ་པར་ལྟ་ཞིང་འགྲོ་བ་དང་། སྤོབས་པ་བརྩེགས་པ་དང་། ཡེ་ཤེས་ཕུང་པོ་དང་། མཐོང་བ་དོན་ཡོད་དང་། བཟང་སྐྱོང་ལ་སོགས་པ་དང་། སྐྱེས་བུ་དམ་པ་བརྒྱད་པོ་གང་སྤོས་ཀྱི་གླང་པོ་དང་། རིན་ཆེན་མཐའ་ཡས་མཛོད་དང་། ཤེས་རབ་བརྩེགས་པ་དང་། མཆོད་པ་བཀོད་པ་དང་། སེང་གེ་རྣམ་པར་སྒྲོགས་པའི་སྒྲ་དབྱངས་ཀྱི་རྒྱལ་པོ་དང་། བློའི་བཀོད་པས་ལེགས་པར་བརྒྱན་པ་ལ་གནས་པ་དང་། སེང་གེའི་སྟབས་ཀྱིས་འགྲོ་བ་དང་། སྤོབས་པ་མཐའ་ཡས་པར་བསྒྲུབ་པ་ལ་འཇིགས་པ་མེད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་ལ་སོགས་པ་དང་།
en: They included the bodhisattva Maitreya, as well as the youthful Mañjuśrī, Avalokiteśvara, Sound of Thunder, Mind of Blooming Flowers of a Hundred Thousand Virtues, Possessor of the Mind of Infinite Practice and the Speech That Is Adorned with Flashes of Lightning, Possessor of the Mind of Complete Detachment, King of Renown, Perceiver of the Agreeable and the Disagreeable, King of the Splendid Light of Deep Accumulations of Gold, Seeing and Moving Across a Hundred Yojanas, Heaps of Eloquence, Mass of Wisdom, Amoghadarśin, Bhadrapāla, the Eight Holy Beings, Gandhahastin, Jewel Treasury, Heaps of Insight, Array of Offerings, King of the Melodious Lion’s Roar, Adorned with Arrays of Wisdom, Moving with the Gait of a Lion, Fearless in Limitless Mastery of Eloquence, the bodhisattva Prāmodyarāja, and others.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་གང་དག་རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་རྣམས་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། དབང་སྒྱུར་དང་། ཚངས་པ་ཆེན་པོ་དང་། ཀླུའི་བདག་པོ་དང་། གནོད་སྦྱིན་གྱི་བདག་པོ་དང་། ལྷ་མ་ཡིན་གྱི་བདག་པོ་དང་། ནམ་མཁའ་ལྡིང་གི་བདག་པོ་དང་། མི་འམ་ཅིའི་བདག་པོ་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་བདག་པོ་དང་། དྲི་ཟའི་བདག་པོ་དང་། དེ་དག་ཐམས་ཅད་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ
en: From the world systems of the great trichiliocosm came the Four Great Kings, Śakra, Brahmā, Īśvara, Mahābrahmā, nāga leaders, yakṣa leaders, asura leaders, garuḍa leaders, kinnara leaders, mahorāga leaders, and gandharva leaders, arriving in the presence of the Blessed One,

source: བཅོམ་ལྡན་འདས་ལ་མེ་ཏོག་སིལ་མས་གཏོར་ནས་འཁོད་པར་གྱུར་ཏོ། །
en: scattering flowers before him, and then taking their places in the gathering.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོས་ཉིན་ཞག་བདུན་ཟས་བཅད་དེ་
en: At that time, the bodhisattva Prāmodyarāja observed seven days of fasting during

source: འཆག་ཅིང་འགྲེང་ལ་འདུག་བཞིན་དུ་གློས་མ་ཕབ་པར་རྨུགས་པ་དང་། གཉིད་མེད་པར་མངོན་པར་བརྩོན་པར་གྱུར་ཏོ། །
en: which he would either stand or sit upright, practicing with unrelenting diligence, free from drowsiness and without sleep.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: It was then that the bodhisattva Prāmodyarāja spoke to the Blessed One:

source: བྱང་ཆུབ་སེམས་དཔའ་ཆོས་གང་རྫོགས་པར་བགྱིས་ན་
en: “Which quality must bodhisattvas perfect

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་དང་སྤྱོད་པ་འཚལ་བར་འགྱུར་བ་དང་།
en: in order for them to know the thoughts and conduct of all sentient beings,

source: སངས་རྒྱས་རྣམས་ཀྱི་དགོངས་པའི་བཀའ་ལ་འཇུག་པར་འགྱུར་བ་དང་།
en: to apply the words that have the intent of all the buddhas,

source: ཕྱིན་ཅི་ལོག་ཏུ་སྟོན་པ་ལས་མི་སྟོན་པར་འགྱུར་བ་དང་།
en: to avoid teaching based on incorrect teachings,

source: སྒྲ་ཇི་ལྟ་བ་བཞིན་དུ་བདེན་པ་ཤེས་པ་ལ་རྗེས་སུ་འཇུག་པར་འགྱུར་བ་དང་།
en: to follow knowledge grounded in truth as literally expressed,

source: ད་ལྟར་གྱི་སངས་རྒྱས་ཐམས་ཅད་ལ་སྒྲིབ་པ་མེད་པར་འགྱུར་བ་དང་།
en: and to become free of any obscuration with respect to all the buddhas of the present?

source: འདི་ལྟ་སྟེ་སངས་རྒྱས་དང་འགྲོགས་པ་འཐོབ་ཅིང་མཐོང་བ་དང་།
en: Through which quality may they be able to accompany and perceive the buddhas,

source: ཆོས་ཀྱིས་ངེས་པ་འཐོབ་པར་འགྱུར་བ་དང་།
en: achieve certainty through the Dharma,

source: འཇིག་རྟེན་གྱི་ཆོས་ལ་ཡང་སྤྱོད་ལ་འཇིག་རྟེན་པས་ཀྱང་མི་གོས་པར་འགྱུར་བ་དང་།
en: follow the ways of the world without becoming stained by the world,

source: སྙོམས་པར་འཇུག་པ་ལ་གནས་ཀྱང་དེ་དེར་སྐྱེ་བར་མི་འགྱུར་བ་དང་།
en: abide in meditative attainments without taking birth in the corresponding realms,

source: མྱ་ངན་ལས་འདས་པའི་ཆོས་ལ་སྤྱོད་ཀྱང་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་མི་འགྱུར་བ་དང་།
en: practice the Dharma of nirvāṇa without transcending suffering,

source: སངས་རྒྱས་ཀྱི་སྨོན་ལམ་ཡོངས་སུ་རྫོགས་པར་མ་བགྱིས་པར་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཆོས་ལ་སྤྱོད་ཀྱང་
en: and practice the Dharma of hearers and solitary buddhas in which the aspirations of buddhahood are not perfected,

source: ཐེག་པ་དེ་དག་གིས་ངེས་པར་མི་འབྱུང་བར་འགྱུར་བ་དང་།
en: without achieving deliverance through those vehicles?

source: སངས་རྒྱས་རྗེས་སུ་དྲན་པ་ལ་སེམས་ནག་ནོག་མ་མཆིས་པར་འགྱུར་བ་དང་།
en: Through which quality may their minds be unclouded in recollecting the buddhas,

source: ཁམས་སྣ་ཚོགས་ལ་ཡང་འཇུག་ལ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་ཡང་འཇུག་པར་འགྱུར་བ་དང་།
en: may they engage with the different dispositions and also be in accord with them all,

source: ཞུ་བ་དང་། སྤོབས་པའི་བསམ་པ་ལ་ཟིལ་གྱིས་ནོན་པར་མི་འགྱུར་བ་དང་།
en: not become overpowered by any question or eloquence,

source: སངས་རྒྱས་ཀྱི་ཞིང་གི་བཀོད་པ་མཐའ་ཡས་པ་རབ་ཏུ་འཛིན་ཅིང་ཤེས་རབ་མ་ལུས་པར་འཐོབ་པར་འགྱུར་བ་དང་།
en: apprehend all the infinite displays of the buddha realms, attain all forms of insight,

source: སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བགྱིད་ལ་སེམས་ཅན་གྱི་འདུ་ཤེས་ལ་ཡང་མི་གནས་པར་འགྱུར་བ་དང་།
en: bring sentient beings to maturation without adhering to the notion of ‘sentient being,’

source: ཆོས་ཀྱང་སྟོན་ལ། དམིགས་པ་ལ་ཡང་མི་གནས་པ་དང་།
en: teach the Dharma yet not fixate on any objective references,

source: མྱ་ངན་ལས་འདས་པ་ཡང་སྨྲ་ལ། ཉེ་བར་ཞི་བ་གང་ཡང་མི་དམིགས་པར་འགྱུར་བ་དང་།
en: explain nirvāṇa yet not objectify this peacefulness in any way,

source: བྱང་ཆུབ་ཀྱི་ཕྱིར་ཡང་སྤྱོད་ལ་མི་གནས་པར་ཡང་འགྱུར་བ་དང་། མཆིས་པ་དང་།
en: act for the sake of awakening without fixation, and give up existence,

source: མ་མཆིས་པ་ཡོངས་སུ་སྤངས་ཀྱང་རྒྱ་ཆེན་པོ་ལ་མོས་པར་འགྱུར་བར་བགྱིད་པ་དག །
en: as well as no existence, but aspire to what is vast?

source: བཅོམ་ལྡན་འདས་བདག་མ་འཚལ་བཞིན་དུ་ནི་མི་ཞུ་ན།
en: Blessed One, I do not ask in this way without any knowledge.

source: འོན་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱིས་བསྟན་དུ་གསོལ།
en: Nevertheless, please explain.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསོལ་ཏོ། །
en: Then the bodhisattva Prāmodyarāja spoke these verses:

source: ལྷ་མི་གནོད་སྦྱིན་དྲི་ཟ་འཁོར་མང་པོ། །མཐའ་ཡས་ཇི་ལྟར་མོས་བཞིན་ཚོགས་ལགས་པས། །
en: “A large assembly of gods, humans, yakṣas, and gandharvas Have gathered here in accordance with their infinite aspirations.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤྱོད་པ་གང་། །
en: What is the practice of the bodhisattvas?

source: འཇིག་རྟེན་དག་གི་མགོན་པོ་འོད་མཛད་པ། །
en: You are the protector of the worlds, the Illuminator,

source: སྨྲ་བའི་ཟླ་བ་ལ་ནི་ཞུ་ལགས་ན། །
en: “Moon of Speech—as I beseech you,

source: གོ་རིམས་བཞིན་དུ་བདག་ལ་ལུང་བསྟན་གསོལ། །
en: Please give the teaching in step-by-step fashion.

source: བྱང་ཆུབ་སྤྱོད་མཆོག་ཡོན་ཏན་ཐོས་ནས་ནི། །སྐྱེ་བོ་ཕལ་ཆེན་འདུན་གྱུར་བྱང་ཆུབ་བརྩོན། །
en: When common people hear of the qualities of supreme awakening, They become inspired and endeavor for awakening.

source: བྱང་ཆུབ་ཡོན་ཏན་མཆོག་ལ་དད་བསྐྱེད་ནས། །
en: “With faith in the supreme qualities of awakening,

source: ཡོན་ཏན་ཀུན་མཐར་ཕྱིན་ལ་ཞུ་ལགས་ན། །
en: I ask you who have perfected all good qualities.

source: གྲགས་པ་མཐའ་ཡས་བདག་གི་སེམས་མཁྱེན་ཏམ། །
en: Master of infinite renown, do you know my mind?

source: རྒྱལ་བ་མ་གཏོགས་དཔང་གཞན་བདག་ལ་མེད། །
en: Other than the Victorious One, who could be my witness?

source: རྒྱལ་བའི་ཡོན་ཏན་ལྷ་མི་ཤིན་ཏུ་སྐོམ། །
en: “Gods and humans are thirsting for the qualities of the victorious ones.

source: སྟོབས་བཅུའི་སྤྱོད་པ་རྣམ་པར་ཕྱེ་སྟེ་གསུངས། །
en: Please explain, delineating the practices of the ten powers.

source: ཡོན་ཏན་མཆོག་སྤྱོད་བྱང་ཆུབ་ཡོན་ཏན་བྱུང་། །
en: You possess the supreme qualities and have the qualities of awakening.

source: གྲགས་མཛེས་ཚུལ་ཆེན་ཁྱོད་ཀྱི་མཁྱེན་སྤྱོད་གསུངས། །
en: You who know the great ways of renown and beauty, please explain!

source: ཇི་ནས་ཡེ་ཤེས་འོད་ཟེར་འཕྲོ་བགྱིད་ཅིང་། །ནག་པོའི་རྩ་ལག་དཔུང་བཅས་འཇོམས་བགྱིད་ལ། །
en: “How do the brilliant light rays of wisdom Conquer the forces of darkness and their armies?

source: ཇི་ནས་སྟོང་གསུམ་མྱུར་དུ་གཡོ་བགྱིད་པ། །
en: How is the trichiliocosm quickly shaken?

source: དེ་འདྲའི་བྱང་ཆུབ་སྤྱོད་པ་བདེ་གཤེགས་གསུངས། །
en: Well-Gone One, please explain about such activities of awakening.

source: ཇི་ནས་མཚན་གྱི་མེ་ཏོག་རྒྱས་འགྱུར་ཞིང་། །
en: “How does the flower of the buddha marks blossom?

source: ཇི་ནས་མཐའ་ཡས་དབྱངས་ལྡན་འགྱུར་བ་དང་། །
en: How does one come to possess an infinite voice?

source: ཇི་ནས་རི་རབ་འདྲ་བའི་ཏིང་འཛིན་འགྱུར། །
en: How does the absorption that resembles Sumeru arise?

source: དེ་འདྲའི་བྱང་ཆུབ་སེམས་སྤྱོད་བཤད་དུ་གསོལ། །
en: Please explain such practices of the mind of awakening.

source: མཉམ་མེད་མཚུངས་མེད་གཡོ་མེད་ཚུལ་འཆོས་མེད། །
en: “Incomparable and unrivaled, you are without guile or pretense,

source: ང་བྲལ་དགྲ་བཅོམ་དྲི་གསུམ་དྲི་བྲལ་བ། །
en: Selfless, worthy, and free from contamination of the three stains.

source: དགེ་སྦྱོང་མཆོག་སྟེ་མཁས་པའི་ཚོགས་ཀྱིས་བསྟོད། །
en: You are the supreme mendicant praised by throngs of the learned—

source: ཁྱོད་ལ་མི་མཆོག་དག་གི་སྤྱོད་པ་ཞུ། །
en: I ask you about the practices of supreme people.

source: རྟོགས་བློ་བརྟན་པོ་དྲན་ལྡན་མེ་ཏོག་གསུང་། །
en: “Your understanding is stable and mindful, and you have the flower of speech.

source: འཁྲུལ་མེད་ལེགས་སྤྱད་སྤྱོད་མངའ་སྨྲ་བའི་མཆོག །
en: Unconfused, you master excellent conduct and are the best of orators.

source: དྲི་བསལ་སྐྱེས་བཟང་ཁྱུ་མཆོག་ཕན་མཛད་པ། །
en: Good person free from stains, supreme leader and benefactor,

source: ཅི་ནས་རྒྱལ་འགྱུར་དེ་ལྟར་བདག་ལ་གསུངས། །
en: Please teach me how to become victorious.

source: ཁྱོད་ལས་ཉིན་མཚན་དག་ཏུ་འདི་དག་གིས། །
en: “When I have heard these matters from you,

source: མཉན་ནས་བྱང་ཆུབ་སྤྱོད་པ་ཡང་དག་ལ། །
en: I shall pursue the true practices of awakening throughout day and night.

source: ཡིད་ལ་བྱེད་པ་གཞན་མེད་བདེ་བ་ཡིས། །
en: Without anything else occupying my mind,

source: སྤྱོད་པ་འདི་ལ་མཆོག་ཏུ་སྤྱོད་པར་འགྱུར། །
en: I shall joyfully devote myself fully to these practices.

source: ཇི་ནས་ཏིང་འཛིན་ལྡན་ཞིང་གཟུངས་ལྡན་དང་། །
en: “How does one possess absorption and retention?

source: ཇི་ནས་བློ་དང་ཤེས་རབ་སྤོབས་ལྡན་དང་། །
en: How does one possess wisdom, insight, and eloquence?

source: ཕྱོགས་མཐའ་ཡས་པར་སངས་རྒྱས་མཐོང་བ་དང་། །
en: How is one able to behold buddhas in infinite directions,

source: ཚུལ་དང་ཚུལ་མིན་དྲི་བ་འདྲི་བ་དང་། །
en: And to ask questions regarding what is right and what is not?

source: ཇི་ལྟར་ཡེ་ཤེས་མཚུངས་མེད་འགྱུར་བ་དང་། །
en: “How is unequaled wisdom realized?

source: དགེ་བ་སྒོ་བརྒྱ་དག་ནི་བསྒྲུབ་པ་དང་། །
en: How are the hundreds of avenues of virtue accomplished?

source: འཆད་པ་ལ་ནི་འཁྲུལ་པ་མེད་འགྱུར་བ། །
en: And how does the teaching become free from error?

source: སྟོབས་བཅུའི་སྤྱོད་པ་ཁྱོད་ལ་ཞུ་ལགས་སོ། །
en: This I ask of you, who practices the ten powers.

source: སྲིད་པའི་བདེ་ལ་ཆགས་ཏེའང་མི་ཞུའོ། །
en: “I ask not out of attachment to the pleasures of existence,

source: ཡུལ་གྱིས་བསྒྱུར་སླད་དུ་ཡང་མི་ཞུའོ། །
en: Or because I am swayed by objects.

source: རྒྱལ་བའི་བདུད་རྩི་ལ་ནི་བདག་ལེགས་འདུན། །
en: I cherish the elixir of the victorious ones.

source: སྟོབས་བཅུའི་སྤྱོད་པ་བདག་ལ་མྱུར་དུ་གསུངས། །
en: So please, quickly, teach me about the practice of the ten powers!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One then spoke to the bodhisattva Prāmodyarāja:

source: མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་ལེགས་སོ་ལེགས་སོ། །
en: “Excellent, Prāmodyarāja, excellent!

source: ཆོས་ཐམས་ཅད་ཀྱི་ཚུལ་ལ་ངེས་པར་སྟོན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དེ།
en: I possess the absorption called elucidating the way of all phenomena.

source: བྱང་ཆུབ་སེམས་དཔའ་ཏིང་ངེ་འཛིན་དེ་དང་ལྡན་ན་ཡོན་ཏན་དེ་དག་འཐོབ་པར་འགྱུར་རོ། །
en: When bodhisattvas possess that absorption, they attain those qualities.

source: གཞན་ཡང་ཕ་རོལ་ཏུ་ཕྱིན་པ་བརྒྱ་ཉི་ཤུ་རྩ་གཅིག་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །
en: Furthermore, they perfect one hundred and twenty-one perfections.

source: ཏིང་ངེ་འཛིན་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་འཐོབ་པར་འགྱུར་རོ། །གཟུངས་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་འཐོབ་པར་འགྱུར་རོ། །
en: They attain eighty-four thousand absorptions and eighty-four thousand retentions.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་ལ་འཇུག་པ་མཁས་པ་ཡང་རྟོགས་པར་འགྱུར་རོ། །
en: They realize expert ways of engaging in the conduct of all sentient beings,

source: མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་ཡང་འགྱུར་རོ། །
en: and they quickly awaken to unexcelled, complete, and perfect buddhahood.

source: མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ཚུལ་ལ་ངེས་པར་སྟོན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དེ་གང་ཞེ་ན།
en: “Prāmodyarāja, what is the absorption called elucidating the way of all phenomena?

source: འདི་ལྟ་སྟེ་ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་དུ་བྱེད་པ་ཉིད་དོ། །
en: It is doing exactly what one says.

source: ཇི་ལྟར་བྱས་པ་དེ་བཞིན་དུ་སྨྲ་བ་ཉིད་དོ། །
en: It is saying exactly what one has done.

source: ལུས་དག་པར་བྱེད་དོ། །
en: It is purifying the body,

source: ངག་དག་པར་བྱེད་དོ། །
en: purifying the speech,

source: སེམས་དག་པར་བྱེད་དོ། །
en: and purifying the mind.

source: ཕན་པར་འདོད་པ་ཉིད་དོ། །
en: It is the wish to benefit.

source: བྱམས་པའི་སེམས་དང་ལྡན་པ་ཉིད་དོ། །
en: It is being endowed with love,

source: སྙིང་རྗེ་ཉིད་མི་སྤོང་བའོ། །
en: not relinquishing compassion,

source: འདོད་པ་དག་ལ་དོན་དུ་མི་གཉེར་བ་ཉིད་དོ། །
en: not pursuing pleasures,

source: ཆོས་དོན་དུ་གཉེར་བ་ཉིད་དོ། །
en: pursuing the Dharma,

source: དད་པ་ཆུད་ཟ་བར་མི་བྱེད་པའོ། །
en: ensuring that faith is not wasted,

source: རང་གིས་དམ་བཅས་པ་ཀུན་ཏུ་སྤྱོད་པ་ཉིད་དོ། །
en: and practicing in accordance with one’s pledges.

source: ངེས་པའི་ཚིག་ལ་མཁས་པའོ། །
en: It is being expert regarding language.

source: སེམས་ཅན་སྒྲོལ་བའོ། །
en: It is liberating sentient beings,

source: ཅང་ཤེས་ཀྱི་ལས་ཅན་ནོ། །
en: practicing well-considered deeds,

source: ལུས་ལ་མི་བརྐམ་པ་ཉིད་དོ། །
en: not having bodily cravings,

source: སེམས་རྒྱུ་བ་མེད་པ་ཉིད་དོ། །
en: and having an unwavering mind.

source: སྡུག་བསྔལ་དང་ལྡན་པ་རྣམས་ལ་ཚིམ་པར་བྱེད་པ་ཉིད་དོ། །
en: It is easing those in pain,

source: བདེ་བ་དང་ལྡན་པ་རྣམས་ལ་གཟེངས་སྟོད་པའོ། །
en: ennobling the happy,

source: བག་མེད་པ་རྣམས་ལ་འདོམས་པའོ། །
en: restraining the careless,

source: བརྩོན་པ་རྣམས་ལ་འཆོས་པའོ། །
en: improving the diligent,

source: ཆོས་ལ་འགྱོད་པ་དག་སེལ་བ་ཉིད་དོ། །
en: dispelling regrets regarding the Dharma,

source: སེམས་ཅན་གྱི་འདུ་ཤེས་ལ་མི་གནས་པའོ། །
en: not harboring preconceptions regarding sentient beings,

source: དངོས་པོའི་འདུ་ཤེས་ཀྱིས་རྟོག་པ་མེད་པའོ། །
en: not harboring preconceptions regarding entities,

source: འཛིན་པ་ཡོངས་སུ་གཅོད་པའོ། །
en: cutting through grasping,

source: མཚན་མ་རྣམ་པར་འཇིག་པ་ཉིད་དོ། །
en: and demolishing attributes.

source: མཉམ་པར་གཞག་པ་ལ་གཡོ་བ་མེད་པའོ། །
en: It is immutable equipoise,

source: རྟག་ཏུ་ཡེ་ཤེས་འཚོལ་བའོ། །
en: the constant pursuit of wisdom,

source: འཇིག་རྟེན་པའི་གཏམ་རྣམ་པར་སྤོང་བ་ཉིད་དོ། །
en: giving up mundane conversation,

source: འཇིག་རྟེན་ལས་འདས་པའི་གཏམ་འཚོལ་བ་ཉིད་དོ། །
en: seeking supramundane conversation,

source: དྲན་པ་ཉམས་པ་མེད་པ་ཉིད་དོ། །
en: impeccable mindfulness,

source: ཆོས་རྣམས་ལ་བརྗོད་པ་མེད་པ་ཉིད་དོ། །
en: and freedom from discussing phenomena.

source: ཇི་ལྟར་བྱ་བ་བཞིན་དུ་འཇུག་པའོ། །
en: It is correct engagement in actions,

source: སྤྱོད་པ་སྒྲུབ་པའོ། །
en: accomplishment in conduct,

source: འཇིག་རྟེན་ཤེས་པ་ཉིད་དོ། །
en: knowledge of the world,

source: ལས་ལ་མངོན་པར་ཡིད་ཆེས་པ་ཉིད་དོ། །
en: and firm conviction in karma.

source: མ་དད་པ་ཡོངས་སུ་སྤོང་བ་ཉིད་དོ། །
en: It is giving up lack of faith,

source: མོས་པ་མང་བ་ཉིད་དོ། །
en: being highly motivated,

source: སངས་རྒྱས་ཡིད་ལ་བྱེད་པའོ། །
en: setting one’s mind on buddhas,

source: འཕེལ་བ་སྟོན་པའོ། །
en: teaching flourishing,

source: བསོད་ནམས་ཀྱི་རྗེས་སུ་ཡི་རང་བ་ཉིད་དོ། །
en: rejoicing in merits,

source: སངས་རྒྱས་ལ་གསོལ་བ་འདེབས་པ་ཉིད་དོ། །
en: supplicating the buddhas,

source: སྦྱིན་གནས་ལ་ཕྱག་འཚལ་བ་ཉིད་དོ། །
en: paying homage to those worthy of offerings,

source: བསྔགས་པ་བརྗོད་པ་ཉིད་དོ། །
en: and expressing praise.

source: ང་རྒྱལ་མེད་པ་ཉིད་དོ། །
en: “It is being free from pride,

source: དགེ་བའི་རྩ་བས་ངོམས་པ་མེད་པ་ཉིད་དོ། །
en: being insatiable regarding roots of virtue,

source: སྦྱོར་བས་རྟག་ཏུ་མངོན་པར་བརྩོན་པའོ། །
en: being constantly diligent,

source: བསྒྲུབ་པ་མི་སྤོང་ཞིང་རྫོགས་པར་བྱེད་པ་ཉིད་དོ། །
en: not giving up on one’s pursuits but ensuring their completion,

source: རྒྱུ་རྐྱེན་གྱི་ལས་བྱ་བ་ལ་འཇིག་རྟེན་ན་རྒྱ་ཆེ་བའོ། །
en: being magnanimous in the world with respect to deeds performed according to causes and conditions,

source: བཅས་པ་མི་འདྲལ་བའོ། །
en: and not forsaking the requisites.

source: གཞི་གཅིག་ཏུ་མི་འཇོག་པ་ཉིད་དོ། །
en: It is not postulating a single metaphysical ground

source: འདི་ཁོ་ན་བདེན་ནོ་ཞེས་མངོན་པར་ཞེན་པ་མེད་པའོ། །
en: and not clinging to the idea that ‘this alone is true.’

source: འདོད་པའི་ཁམས་ལ་ཁྱིམ་མོ་ཞེས་བརྗོད་པ་མི་འཇུག་པའོ། །
en: It is never calling the desire realm ‘home,’

source: གཟུགས་ཀྱི་ཁམས་ལ་མངོན་པར་ཞེན་པ་མེད་པའོ། །
en: not clinging to the form realm,

source: གཟུགས་མེད་པའི་ཁམས་ཀྱི་རང་བཞིན་མ་ཡིན་པའོ། །
en: not being of the nature of the formless realm,

source: ཇི་ལྟར་མངོན་པར་འདུ་བྱེད་པའི་འབྲས་བུ་ལ་མངོན་པར་ཡིད་ཆེས་པ་ཉིད་དོ། །
en: and having firm conviction about how results manifest in accordance with their conditioning.

source: ཡོ་བྱད་ལ་བགོ་བཤའ་བྱེད་ཅིང་སེམས་མཉམ་པ་ཉིད་དོ། །
en: It is sharing one’s own means and being impartial,

source: སེམས་ཅན་ཐམས་ཅད་ལ་གཡོས་མི་སྟོན་པ་ཉིད་དོ། །
en: never tricking any being,

source: སངས་རྒྱས་རྣམས་ལ་མི་སླུ་བ་ཉིད་དོ། །
en: not being deceptive regarding the buddhas,

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་རྣམ་པར་ཐོ་མི་འཚམས་པའོ། །
en: not disparaging bodhisattvas,

source: བསྟན་པ་ལ་ངན་དུ་མི་བརྗོད་པ་ཉིད་དོ། །
en: and not speaking badly about the teachings.
